Revit 2027 API
IFCUserDefinedPropertySet.IsPropertyAMemberOfPropertySet Method
 Checks whether a property exists in the property set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPropertyAMemberOfPropertySet(
	string propertyName
)
Public Function IsPropertyAMemberOfPropertySet (
	propertyName As String
) As Boolean
public:
bool IsPropertyAMemberOfPropertySet(
	String^ propertyName
)
member IsPropertyAMemberOfPropertySet :
        propertyName : string -> bool
Parameters
propertyName String
 The property set name.
Return Value
Boolean
 True if the property exists in the property set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace